package Les_8_Multithreading.Ex5_Concurrency_and_parallelism_Synchronous_and_asynchronous;

public class Example_2_Synchronous_asynchronous {
    //Synchronous - синхронное программирование, когда задачи выполняются последовательно друг за другом.
    //Asynchronous - асинхронно. В асинхронном программировании, когда выполняется одна работа мы можем
    //переключиться на другую работу не дожидаясь окончания первой. Т.е выполнять сразу несколько задач.
    //При этом если процессор многоядерный, то в асинхронном программировании достигается Concurrency при
    //помощи Parallelism (параллелизма), т.е. эти несколько задач могут выполняться параллельно.

    //Асинхронное программирование позволяет нам достичь Concurrency

    //Недетерминированное поведение потоков, это когда потоки выполняются независимо друг от друга и
    //при каждом повторном выполнении порядок выполнения потоков будет разный.

}
